In [4]:
""" learning data science using a classic dataset, the Titanic
"""
import pandas as pd
import numpy as np 
df_titanic = pd.read_csv('data.csv')

In [5]:
df_titanic['Age']
df_titanic['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
882    0
883    1
884    0
885    1
886    0
Name: Survived, Length: 887, dtype: int64

In [12]:
'''selecionando mais de uma coluna,  my_df[['coluns aqui']]
'''
df_titanic[['Name','Age', 'Pclass', 'Fare']]

                                                  Name   Age  Pclass     Fare
0                               Mr. Owen Harris Braund  22.0       3   7.2500
1    Mrs. John Bradley (Florence Briggs Thayer) Cum...  38.0       1  71.2833
2                                Miss. Laina Heikkinen  26.0       3   7.9250
3          Mrs. Jacques Heath (Lily May Peel) Futrelle  35.0       1  53.1000
4                              Mr. William Henry Allen  35.0       3   8.0500
..                                                 ...   ...     ...      ...
882                               Rev. Juozas Montvila  27.0       2  13.0000
883                        Miss. Margaret Edith Graham  19.0       1  30.0000
884                     Miss. Catherine Helen Johnston   7.0       3  23.4500
885                               Mr. Karl Howell Behr  26.0       1  30.0000
886                                 Mr. Patrick Dooley  32.0       3   7.7500

[887 rows x 4 columns]

In [14]:
"""filtrando somente os homens que estavam a bordo e guardando em um DataFrame
"""
filtro_homem = df_titanic['Sex'] == 'male'
df_titanic_homens = df_titanic.loc[filtro_homem]

In [16]:
"""criando um DataFrame somente com os passageiros que sobreviveram
"""
filtro_sobreviventes = df_titanic['Survived'] == 1 
df_titanic_sobreviventes = df_titanic.loc[filtro_sobreviventes]

In [17]:
df_titanic_sobreviventes

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708
...,...,...,...,...,...,...,...,...
871,1,3,Miss. Adele Kiamie Najib,female,15.0,0,0,7.2250
875,1,1,Mrs. Thomas Jr (Lily Alexenia Wilson) Potter,female,56.0,0,1,83.1583
876,1,2,Mrs. William (Imanita Parrish Hall) Shelley,female,25.0,0,1,26.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000

In [26]:
"""criando um DataFrame somente com os homens que sobreviveram
"""
df_titanic_homens_sobreviventes = df_titanic.loc[(filtro_homem) & (filtro_sobreviventes)]

In [27]:
df_titanic_homens_sobreviventes

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
17,1,2,Mr. Charles Eugene Williams,male,23.0,0,0,13.0000
21,1,2,Mr. Lawrence Beesley,male,34.0,0,0,13.0000
23,1,1,Mr. William Thompson Sloper,male,28.0,0,0,35.5000
36,1,3,Mr. Hanna Mamee,male,18.0,0,0,7.2292
54,1,1,Mr. Hugh Woolner,male,46.0,0,0,35.5000
...,...,...,...,...,...,...,...,...
834,1,3,Mr. Chang Chip,male,32.0,0,0,56.4958
835,1,1,Mr. Pierre Marechal,male,29.0,0,0,29.7000
853,1,1,Mr. Peter Denis Daly,male,51.0,0,0,26.5500
865,1,3,Master. Harold Theodor Johnson,male,4.0,1,1,11.1333
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000

In [28]:
"""criando um DataFrame somente com as mulheres que estavam na primeira e segunda classe
"""
filtro_mulher = df_titanic['Sex'] == 'female'
filtro_classe1 = df_titanic['Pclass'] == 1
filtro_classe2 = df_titanic['Pclass'] == 2

df_titanic_mulher_c1_c2 = df_titanic.loc[(filtro_mulher) & ((filtro_classe1) | (filtro_classe2))]

df_titanic_mulher_c1_c2

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708
11,1,1,Miss. Elizabeth Bonnell,female,58.0,0,0,26.5500
15,1,2,Mrs. (Mary D Kingcome) Hewlett,female,55.0,0,0,16.0000
...,...,...,...,...,...,...,...,...
867,1,1,Mrs. Richard Leonard (Sallie Monypeny) Beckwith,female,47.0,1,1,52.5542
870,1,2,Mrs. Samuel (Hannah Wizosky) Abelson,female,28.0,1,0,24.0000
875,1,1,Mrs. Thomas Jr (Lily Alexenia Wilson) Potter,female,56.0,0,1,83.1583
876,1,2,Mrs. William (Imanita Parrish Hall) Shelley,female,25.0,0,1,26.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000

In [29]:
"""criando um DataFrame somente com as mulheres que sobreviveram
"""
df_titanic_mulher_sobreviventes = df_titanic.loc[(filtro_mulher) & (filtro_sobreviventes)]
df_titanic_mulher_sobreviventes

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708
...,...,...,...,...,...,...,...,...
870,1,2,Mrs. Samuel (Hannah Wizosky) Abelson,female,28.0,1,0,24.0000
871,1,3,Miss. Adele Kiamie Najib,female,15.0,0,0,7.2250
875,1,1,Mrs. Thomas Jr (Lily Alexenia Wilson) Potter,female,56.0,0,1,83.1583
876,1,2,Mrs. William (Imanita Parrish Hall) Shelley,female,25.0,0,1,26.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000